Revit 2024 API
ExternalService.GetDefaultServerId Method
 Returns the Id of the default server if one was assigned to the service.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public Guid GetDefaultServerId()
Visual Basic
Public Function GetDefaultServerId As Guid
Visual C++
public:
Guid GetDefaultServerId()
Return Value
 The GUID of the default server, or an invalid GUID if there is none assigned.
Remarks
 Only mandatory services have default servers assigned. Only single-server and built-in multi-server services can currently be mandatory. All other services that are optional don't have a default server.
See Also
ExternalService Class
Autodesk.Revit.DB.ExternalService Namespace